src/main/java/ok/dht/test/yasevich/profiling/stage3/wrk/wrk-put-report5
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 25.023ms, rate sampling interval: 116ms
  Thread calibration: mean lat.: 25.306ms, rate sampling interval: 117ms
  Thread calibration: mean lat.: 25.032ms, rate sampling interval: 118ms
  Thread calibration: mean lat.: 24.415ms, rate sampling interval: 111ms
  Thread calibration: mean lat.: 24.085ms, rate sampling interval: 110ms
  Thread calibration: mean lat.: 23.249ms, rate sampling interval: 102ms
  Thread calibration: mean lat.: 24.733ms, rate sampling interval: 114ms
  Thread calibration: mean lat.: 23.900ms, rate sampling interval: 110ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.22ms   27.05ms 193.79ms   87.30%
    Req/Sec     7.53k     1.92k   20.79k    65.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.79ms
 75.000%   33.34ms
 90.000%   58.53ms
 99.000%  128.45ms
 99.900%  169.98ms
 99.990%  183.04ms
 99.999%  187.90ms
100.000%  193.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.019     0.000000            1         1.00
       1.700     0.100000       299747         1.11
       4.307     0.200000       599362         1.25
       6.967     0.300000       899346         1.43
      10.391     0.400000      1199156         1.67
      14.791     0.500000      1498686         2.00
      17.487     0.550000      1648617         2.22
      20.623     0.600000      1798517         2.50
      24.239     0.650000      1947778         2.86
      28.431     0.700000      2097665         3.33
      33.343     0.750000      2247871         4.00
      36.127     0.775000      2322395         4.44
      39.263     0.800000      2397811         5.00
      42.751     0.825000      2472710         5.71
      46.783     0.850000      2547317         6.67
      51.775     0.875000      2622060         8.00
      54.943     0.887500      2659662         8.89
      58.527     0.900000      2697097        10.00
      62.495     0.912500      2734540        11.43
      67.135     0.925000      2771972        13.33
      73.087     0.937500      2809401        16.00
      76.991     0.943750      2828236        17.78
      81.343     0.950000      2846913        20.00
      85.951     0.956250      2865443        22.86
      91.071     0.962500      2884370        26.67
      96.575     0.968750      2902930        32.00
      99.775     0.971875      2912364        35.56
     103.551     0.975000      2921672        40.00
     107.903     0.978125      2930975        45.71
     112.511     0.981250      2940417        53.33
     117.439     0.984375      2949767        64.00
     120.255     0.985938      2954476        71.11
     123.199     0.987500      2959094        80.00
     126.399     0.989062      2963804        91.43
     129.855     0.990625      2968432       106.67
     133.759     0.992188      2973212       128.00
     136.063     0.992969      2975570       142.22
     138.495     0.993750      2977833       160.00
     141.183     0.994531      2980157       182.86
     144.255     0.995313      2982489       213.33
     147.711     0.996094      2984861       256.00
     149.503     0.996484      2986055       284.44
     151.295     0.996875      2987172       320.00
     153.343     0.997266      2988358       365.71
     155.903     0.997656      2989539       426.67
     158.975     0.998047      2990682       512.00
     161.023     0.998242      2991274       568.89
     163.199     0.998437      2991859       640.00
     165.631     0.998633      2992449       731.43
     167.935     0.998828      2993015       853.33
     170.239     0.999023      2993619      1024.00
     171.391     0.999121      2993903      1137.78
     172.543     0.999219      2994209      1280.00
     173.567     0.999316      2994472      1462.86
     174.847     0.999414      2994783      1706.67
     176.127     0.999512      2995056      2048.00
     176.895     0.999561      2995223      2275.56
     177.535     0.999609      2995349      2560.00
     178.303     0.999658      2995504      2925.71
     179.071     0.999707      2995666      3413.33
     179.839     0.999756      2995799      4096.00
     180.351     0.999780      2995878      4551.11
     180.735     0.999805      2995936      5120.00
     181.247     0.999829      2996014      5851.43
     181.759     0.999854      2996090      6826.67
     182.399     0.999878      2996160      8192.00
     182.655     0.999890      2996191      9102.22
     183.167     0.999902      2996230     10240.00
     183.679     0.999915      2996272     11702.86
     184.063     0.999927      2996302     13653.33
     184.575     0.999939      2996340     16384.00
     184.831     0.999945      2996356     18204.44
     185.087     0.999951      2996373     20480.00
     185.471     0.999957      2996397     23405.71
     185.727     0.999963      2996412     27306.67
     186.111     0.999969      2996434     32768.00
     186.239     0.999973      2996441     36408.89
     186.367     0.999976      2996447     40960.00
     186.623     0.999979      2996459     46811.43
     186.751     0.999982      2996466     54613.33
     187.135     0.999985      2996475     65536.00
     187.263     0.999986      2996480     72817.78
     187.519     0.999988      2996485     81920.00
     187.775     0.999989      2996488     93622.86
     188.159     0.999991      2996493    109226.67
     188.543     0.999992      2996497    131072.00
     188.799     0.999993      2996500    145635.56
     188.927     0.999994      2996501    163840.00
     189.439     0.999995      2996503    187245.71
     190.463     0.999995      2996506    218453.33
     190.975     0.999996      2996508    262144.00
     191.231     0.999997      2996509    291271.11
     191.359     0.999997      2996510    327680.00
     191.615     0.999997      2996511    374491.43
     192.511     0.999998      2996513    436906.67
     192.767     0.999998      2996514    524288.00
     192.767     0.999998      2996514    582542.22
     193.023     0.999998      2996515    655360.00
     193.023     0.999999      2996515    748982.86
     193.151     0.999999      2996516    873813.33
     193.407     0.999999      2996517   1048576.00
     193.407     0.999999      2996517   1165084.44
     193.407     0.999999      2996517   1310720.00
     193.407     0.999999      2996517   1497965.71
     193.535     0.999999      2996518   1747626.67
     193.535     1.000000      2996518   2097152.00
     193.535     1.000000      2996518   2330168.89
     193.535     1.000000      2996518   2621440.00
     193.535     1.000000      2996518   2995931.43
     193.919     1.000000      2996519   3495253.33
     193.919     1.000000      2996519          inf
#[Mean    =       24.218, StdDeviation   =       27.050]
#[Max     =      193.792, Total count    =      2996519]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3597680 requests in 1.00m, 268.21MB read
  Non-2xx or 3xx responses: 2873015
Requests/sec:  59961.71
Transfer/sec:      4.47MB